import os

BOT_TOKEN = os.getenv("BOT_TOKEN")
if not BOT_TOKEN:
    raise ValueError("BOT_TOKEN not set in environment variables")

DATA_FILE = "chats_data.json"

# Список всех рангов по возрастанию
RANK_ORDER = ["$", "*", "**", "***", "****", "#"]
RANK_NAMES = {
    "$": "участник",
    "*": "младший модератор",
    "**": "старший модератор",
    "***": "младший администратор",
    "****": "старший администратор",
    "#": "создатель"
}

# Возможные часовые пояса UTC
UTC_OFFSETS = [str(i) for i in range(-11, 13)]

# Настройка прав для /up и /down: (минимальный ранг, ограничение)
# "мунс" - максимум на один ниже своего
# "мсу" - максимум свой уровень
RIGHT_OPTIONS = {
    1: ("#", "мунс"),
    2: ("****", "мсу"),
    3: ("****", "мунс"),
    4: ("***", "мсу"),
    5: ("***", "мунс"),
    6: ("**", "мсу"),
    7: ("**", "мунс"),
    8: ("*", "мсу"),
}

# Таблица нормализации символов (для фильтра слов)
NORMALIZE_DICT = {
    'а': ['а', 'a', '@'],
    'б': ['б', 'b', '6'],
    'в': ['в', 'b', 'v'],
    'г': ['г'],
    'д': ['д', 'd'],
    'е': ['е', 'e'],
    'ё': ['ё'],
    'ж': ['ж'],
    'з': ['з', 'z', '3'],
    'и': ['и', 'i'],
    'й': ['й', 'i'],
    'к': ['к', 'k'],
    'л': ['л', 'l'],
    'м': ['м', 'm'],
    'н': ['н'],
    'о': ['о', 'o', '0'],
    'п': ['п', 'p'],
    'р': ['р', 'r'],
    'с': ['с', 's', 'c', '$', '€', '¢'],
    'т': ['т', 't'],
    'у': ['у', 'y', 'u', '¥'],
    'ф': ['ф', 'f'],
    'х': ['х', 'x'],
    'ц': ['ц'],
    'ч': ['ч', 'ch'],
    'ш': ['ш', 'sh'],
    'щ': ['щ', 'sch', 'sh'],
    'ъ': ['ъ', '"'],
    'ы': ['ы'],
    'ь': ['ь'],
    'э': ['э'],
    'ю': ['ю'],
    'я': ['я']
}
def get_default_settings():
    return {
        "updown_rights": "1",
        "list_word_access": "***",
        "filter_mode": "off",
        "timezone": "+3",
        "search_mode": "substring",
        "anonymous": "off"
    }
